# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке,
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних.
# Всего на грядке растёт N кустов. Эти кусты обладают разной урожайностью,
# поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход,
# находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
#
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий
# модуль, находясь перед некоторым кустом заданной во входном файле грядки.
#
# Input: 1 3 2 1 1 6
# Output: 10

data = [3, 5, 7, 1, 6, 8, 2, 4]

res = [sum(data[i:i+3]) for i in range(len(data)-2)]
res.append(data[0]+data[1]+data[len(data)-1])
res.append(data[0]+data[len(data)-1]+data[len(data)-2])
maxElement = max(res)
print(maxElement)